DataProcessors/ОбработкаФайлаПоЛьготамИСубсидии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаФайлаПоЛьготамИСубсидии</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЕксель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверкаДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Багачка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Загрузка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУПСЗН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDУчетнойЗаписи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНасчитаная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплаченнаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Выгрузка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУПСЗН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDУчетнойЗаписи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНасчитаная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплаченнаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОПрописанныхЖильцах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СведенияОПрописанныхЖильцах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прописан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Жилец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льгота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовоеНачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегиональнаяСубсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеНаСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеНаСчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоСубсидиям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоЛьготам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоРегиональнымСубсидиям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеПоступления</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ОбработкаФайлаПоЛьготамИСубсидии/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФайлЕксельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ФайлЕксель;
	Фильтр = "Электронная таблица Excel(*.xlsx)|*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ФайлЕксель = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

// Табличная часть "ЗАГРУЗКИ"

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Путь = Объект.ФайлЕксель;
	Объект.Выгрузка.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();//Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик = 7 По КоличествоСтрок Цикл
		НоваяСтрока                   = Объект.Выгрузка.Добавить();
		НоваяСтрока.НомерУПСЗН        = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.IDУчетнойЗаписи   = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.ФИО               = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.ЛицевойСчет       = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.СуммаНасчитаная   = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.СуммаКОплате      = Excel.Cells(Счетчик, 6).Value;
		НоваяСтрока.ОплаченнаяСумма   = Excel.Cells(Счетчик, 7).Value;
	КонецЦикла;
	
	Excel.Workbooks.Close();
	Excel.Quit();
КонецПроцедуры

&НаСервере
Процедура СохранитьВыпискуНаСервере()
	Для Каждого Строка Из Объект.Загрузка Цикл
		Если Объект.Багачка = Ложь И СтрЗаменить(Строка(Строка.НомерУПСЗН), Символы.НПП, "") <> "1605000" Тогда
			Если Строка.ОплаченнаяСумма <> 0 Тогда
				Док = Документы.ПоступлениеНаСчет.СоздатьДокумент();
				Док.БанковскийСчет = Объект.БанковскийСчет;
				Док.Организация    = Объект.Организация;
				Док.Дата           = Объект.ДатаДокумента;
				Если Объект.ТипФайла = "Льготы" Тогда
				    Док.ВидНачисления = Перечисления.ВидыНачислений.Льгота;
				ИначеЕсли Объект.ТипФайла = "Субсидии" Тогда
					Док.ВидНачисления = Перечисления.ВидыНачислений.Субсидия;
				КонецЕсли;
				Док.ВидОперации    = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтЛицевогоСчета;
				Док.ДатаВходящегоДокумента = Объект.ДатаДокумента;
				Док.ЛицевойСчет    = НайтиЛицевойСчет(СтрЗаменить(Строка(Строка.ЛицевойСчет), Символы.НПП, ""));
				Если Док.ЛицевойСчет = Неопределено Тогда
					Сообщить("Не здайдено особового рахунка: " + Строка.ЛицевойСчет  + ". ФИО: " + Строка.ФИО + " ID = " + Строка.IDУчетнойЗаписи);
				    Возврат;	
				КонецЕсли;
				Док.СуммаДокумента = Строка.ОплаченнаяСумма;
				Док.Комментарий    = Объект.ТипФайла;
				Док.РасшифровкаПлатежаСписком = Истина;
				НоваяСтрока = Док.РасшифровкаПлатежа.Добавить();
				НоваяСтрока.ПризнакАванса = Истина;
				НоваяСтрока.Сумма = Строка.ОплаченнаяСумма;
				Попытка
					Док.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение
					Док.Записать();
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Документ не вдалося провести. (Рядок №" + Строка.НомерСтроки + ")";
					Сообщение.Сообщить();
				КонецПопытки;
			КонецЕсли;
		ИначеЕсли Объект.Багачка = Истина И СтрЗаменить(Строка(Строка.НомерУПСЗН), Символы.НПП, "") = "1605000" Тогда
			Если Строка.ОплаченнаяСумма <> 0 Тогда
				Док = Документы.ПоступлениеНаСчет.СоздатьДокумент();
				Док.БанковскийСчет = Объект.БанковскийСчет;
				Док.Организация    = Объект.Организация;
				Док.Дата           = Объект.ДатаДокумента;
				Если Объект.ТипФайла = "Льготы" Тогда
				    Док.ВидНачисления = Перечисления.ВидыНачислений.Льгота;
				ИначеЕсли Объект.ТипФайла = "Субсидии" Тогда
					Док.ВидНачисления = Перечисления.ВидыНачислений.Субсидия;
				КонецЕсли;
				Док.ВидОперации    = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтЛицевогоСчета;
				Док.ДатаВходящегоДокумента = Объект.ДатаДокумента;
				Док.ЛицевойСчет    = НайтиЛицевойСчет(СтрЗаменить(Строка(Строка.ЛицевойСчет), Символы.НПП, ""));
				Если Док.ЛицевойСчет = Неопределено Тогда
					Сообщить("Не здайдено особового рахунка за кодом ID. " + Строка.ЛицевойСчет  + ". ФИО: " + Строка.ФИО + " ID = " + Строка.IDУчетнойЗаписи);
					Возврат;
				КонецЕсли;
				Док.СуммаДокумента = Строка.ОплаченнаяСумма;
				Док.Комментарий    = Объект.ТипФайла;
				Док.РасшифровкаПлатежаСписком = Истина;
				НоваяСтрока = Док.РасшифровкаПлатежа.Добавить();
				НоваяСтрока.ПризнакАванса = Истина;
				НоваяСтрока.Сумма = Строка.ОплаченнаяСумма;
				Попытка
					Док.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение
					Док.Записать();
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Документ не вдалося провести. (Рядок №" + Строка.НомерСтроки + ")";
					Сообщение.Сообщить();
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВыписку(Команда)
	СохранитьВыпискуНаСервере();
КонецПроцедуры



// Табличная часть "ВЫГРУЗКА"
//// ФОРМИРОВАНИЕ И ВЫГРУЗКА ДАННЫХ В ФАЙЛ EXCEL ////

&НаСервере
Процедура СформироватьНачисленияНаСервере1()
	тзНачисленияЛьготы = Объект.Выгрузка.Выгрузить();
	Организация = Объект.Организация;
	Для Каждого стр Из тзНачисленияЛьготы Цикл
		Если Объект.Багачка = ЛОЖЬ И СтрЗаменить(Строка(стр.НомерУПСЗН), Символы.НПП, "") <> "1605000" Тогда
			ЛицевойСчет = НайтиЛицевойСчет(СтрЗаменить(Строка(стр.ЛицевойСчет), Символы.НПП, ""));
			Если ЛицевойСчет = Неопределено Тогда
				Сообщить("Не здайдено особового рахунка № " + стр.ЛицевойСчет  + ". ФИО: " + стр.ФИО);  
			КонецЕсли;
			Запрос = Новый Запрос;
			Запрос.Текст =
			    "ВЫБРАТЬ
			    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход КАК Начислено,
			    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток
			    |ИЗ
			    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
			    |			&НачалоПериода,
			    |			&КонецПериода,
			    |			Авто,
			    |			,
			    |			Организация = &Организация
			    |				И ЛицевойСчет = &ЛицевойСчет
			    |				И Услуга.ВидУслуги = &Услуга) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты";
			Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ДатаДокумента)); 
			Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ДатаДокумента));
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
			Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
 
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Начислено = Выборка.Начислено;
				//КонечныйОстаток = Выборка.КонечныйОстаток;
			КонецЦикла;
			КонечныйОстаток = ОбщийМодульМВК.ПолучитьОстатки(Объект.ДатаДокумента, ЛицевойСчет, Объект.Услуга);
			
			стр.СуммаНасчитаная = Начислено;
			Если КонечныйОстаток = Неопределено Тогда
				КонечныйОстаток = 0;
			КонецЕсли;
			Если КонечныйОстаток <= 0 Тогда
				стр.СуммаКОплате = 0;
			Иначе
			    стр.СуммаКОплате = КонечныйОстаток;
			КонецЕсли;	
		ИначеЕсли Объект.Багачка = Истина И СтрЗаменить(Строка(стр.НомерУПСЗН), Символы.НПП, "") = "1605000" Тогда
			ЛицевойСчет = НайтиЛицевойСчет(СтрЗаменить(Строка(стр.ЛицевойСчет), Символы.НПП, ""));
			Если ЛицевойСчет = Неопределено Тогда
				Сообщить("Не здайдено особового рахунка № " + стр.ЛицевойСчет  + ". ФИО: " + стр.ФИО);  
			КонецЕсли;
			Запрос = Новый Запрос;
			Запрос.Текст =
			    "ВЫБРАТЬ
			    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход КАК Начислено,
			    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток
			    |ИЗ
			    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
			    |			&НачалоПериода,
			    |			&КонецПериода,
			    |			Авто,
			    |			,
			    |			Организация = &Организация
			    |				И ЛицевойСчет = &ЛицевойСчет
			    |				И Услуга.ВидУслуги = &Услуга) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты";
			Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ДатаДокумента)); 
			Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ДатаДокумента));
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
			Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
 
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Начислено = Выборка.Начислено;
				КонечныйОстаток = Выборка.КонечныйОстаток;
			КонецЦикла;
			
			Если КонечныйОстаток = Неопределено Тогда
				КонечныйОстаток = 0;
			КонецЕсли;
			
			стр.СуммаНасчитаная = Начислено;
			Если КонечныйОстаток <= 0 Тогда
				стр.СуммаКОплате = 0;
			Иначе
			    стр.СуммаКОплате = КонечныйОстаток;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Объект.Выгрузка.Загрузить(тзНачисленияЛьготы);
КонецПроцедуры


&НаСервере
Процедура СформироватьНачисленияНаСервере()
	тзНачисленияЛьготы = Объект.Выгрузка.Выгрузить();
	Организация = Объект.Организация; //ОСМДПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
	Для Каждого стр Из тзНачисленияЛьготы Цикл
		Если Объект.Багачка = ЛОЖЬ И СтрЗаменить(Строка(стр.НомерУПСЗН), Символы.НПП, "") <> "1605000" Тогда
			ЛС = НайтиЛицевойСчет(СтрЗаменить(Строка(стр.ЛицевойСчет), Символы.НПП, ""));
			Если ЛС = Неопределено Тогда
				Сообщить("Не здайдено особового рахунка за кодом ID. " + стр.ЛицевойСчет  + ". ФИО: " + стр.ФИО);  
			КонецЕсли;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			    "ВЫБРАТЬ
			    |	РасчетыПоЛицевымСчетамОбороты.СуммаРасход
			    |ИЗ
			    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(&НачалоПериода, &КонецПериода, Авто, ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОбороты";
			Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(Объект.ДатаДокумента), -1));
			Запрос.УстановитьПараметр("КонецПериода", ДобавитьМесяц(КонецМесяца(Объект.ДатаДокумента), -1));
			Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Оплата = 0;
			Пока Выборка.Следующий() Цикл
				Оплата = Оплата + Выборка.СуммаРасход;
			КонецЦикла;
		
			Запрос = Новый Запрос;
			Запрос.Текст =
			    "ВЫБРАТЬ
			    |	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток,
			    |	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления,
			    |	РасчетыПоЛицевымСчетамОстатки.Услуга
			    |ИЗ
			    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(&НачалоПериода, ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстатки";
			
			
			Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(Объект.ДатаДокумента), -1));
			Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
			Результат = Запрос.Выполнить().Выгрузить();
			Долг = Результат.Итог("СуммаОстаток");
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			    "ВЫБРАТЬ
			    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход КАК Начислено,
			    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток
			    |ИЗ
			    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
			    |			&НачалоПериода,
			    |			&КонецПериода,
			    |			Авто,
			    |			,
			    |			Организация = &Организация
			    |				И ЛицевойСчет = &ЛицевойСчет
			    |				И Услуга.ВидУслуги = &Услуга) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты";
			Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ДатаДокумента)); 
			Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ДатаДокумента));
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
			Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
 
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Начислено = Выборка.Начислено;
			КонецЦикла;
			
			стр.СуммаНасчитаная = Начислено;
			КолонкаДолг = 0;
			КолонкаДолг = Долг - Оплата;
			Если КолонкаДолг = 0 Тогда
				стр.СуммаКОплате = стр.СуммаНасчитаная;
			КонецЕсли;
			Если КолонкаДолг < 0 Тогда
				стр.СуммаКОплате = стр.СуммаНасчитаная + КолонкаДолг;
				Если стр.СуммаКОплате <= 0 Тогда
					стр.СуммаКОплате = 0;
				КонецЕсли;
			КонецЕсли;
			Если КолонкаДолг > 0 Тогда
				стр.СуммаКОплате = стр.СуммаНасчитаная + КолонкаДолг;
			КонецЕсли;
			
		ИначеЕсли Объект.Багачка = Истина И СтрЗаменить(Строка(стр.НомерУПСЗН), Символы.НПП, "") = "1605000" Тогда
			ЛС = НайтиЛицевойСчет(СтрЗаменить(Строка(стр.ЛицевойСчет), Символы.НПП, ""));
			Если ЛС = Неопределено Тогда
				Сообщить("Не здайдено особового рахунка за кодом ID. " + стр.ЛицевойСчет  + ". ФИО: " + стр.ФИО);  
			КонецЕсли;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			    "ВЫБРАТЬ
			    |	РасчетыПоЛицевымСчетамОбороты.СуммаРасход
			    |ИЗ
			    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(&НачалоПериода, &КонецПериода, Авто, ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОбороты";
			Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(Объект.ДатаДокумента), -1));
			Запрос.УстановитьПараметр("КонецПериода", ДобавитьМесяц(КонецМесяца(Объект.ДатаДокумента), -1));
			Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Оплата = 0;
			Пока Выборка.Следующий() Цикл
				Оплата = Оплата + Выборка.СуммаРасход;
			КонецЦикла;
		
			Запрос = Новый Запрос;
			Запрос.Текст =
			    "ВЫБРАТЬ
			    |	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток,
			    |	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления,
			    |	РасчетыПоЛицевымСчетамОстатки.Услуга
			    |ИЗ
			    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(&НачалоПериода, ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстатки";
			
			
			Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(Объект.ДатаДокумента), -1));
			Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
			Результат = Запрос.Выполнить().Выгрузить();
			Долг = Результат.Итог("СуммаОстаток");
			
			спУслуги = Новый СписокЗначений;
			спУслуги.Добавить(Объект.Услуга);
			спУслуги.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000148"));
			спУслуги.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000190"));
			спУслуги.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000191"));
			спУслуги.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000193"));
			спУслуги.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000215"));
			спУслуги.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000216"));
			Запрос = Новый Запрос;
			Запрос.Текст =
			    "ВЫБРАТЬ
			    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход КАК Начислено,
			    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток
			    |ИЗ
			    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
			    |			&НачалоПериода,
			    |			&КонецПериода,
			    |			Авто,
			    |			,
			    |			Организация = &Организация
			    |				И ЛицевойСчет = &ЛицевойСчет
			    |				И Услуга.ВидУслуги В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты";
			Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ДатаДокумента)); 
			Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ДатаДокумента));
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
			Запрос.УстановитьПараметр("Услуга", спУслуги);
 
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Начислено = Выборка.Начислено;
			КонецЦикла;
			
			стр.СуммаНасчитаная = Начислено;
			КолонкаДолг = 0;
			КолонкаДолг = Долг - Оплата;
			Если КолонкаДолг = 0 Тогда
				стр.СуммаКОплате = стр.СуммаНасчитаная;
			КонецЕсли;
			Если КолонкаДолг < 0 Тогда
				стр.СуммаКОплате = стр.СуммаНасчитаная + КолонкаДолг;
				Если стр.СуммаКОплате <= 0 Тогда
					стр.СуммаКОплате = 0;
				КонецЕсли;
			КонецЕсли;
			Если КолонкаДолг > 0 Тогда
				стр.СуммаКОплате = стр.СуммаНасчитаная + КолонкаДолг;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Объект.Выгрузка.Загрузить(тзНачисленияЛьготы);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНачисления(Команда)
	Путь = Объект.ФайлЕксель;
	Объект.Выгрузка.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();//Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик = 7 По КоличествоСтрок Цикл
		НоваяСтрока                   = Объект.Выгрузка.Добавить();
		НоваяСтрока.НомерУПСЗН        = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.IDУчетнойЗаписи   = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.ФИО               = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.ЛицевойСчет       = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.СуммаНасчитаная   = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.СуммаКОплате      = Excel.Cells(Счетчик, 6).Value;
		НоваяСтрока.ОплаченнаяСумма   = Excel.Cells(Счетчик, 7).Value;
	КонецЦикла;
	
	Excel.Workbooks.Close();
	Excel.Quit();
	СформироватьНачисленияНаСервере();
КонецПроцедуры

&НаСервере
Функция НайтиЛицевойСчет(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(
	    |			&НаДату,
	    |			ЛицевойСчет.Наименование = &Наименование
	    |				И Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Наименование", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛС = Выборка.ЛицевойСчет;
	КонецЦикла;
	Возврат ЛС;
КонецФункции

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	Если Объект.Выгрузка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Путь = Объект.ФайлЕксель;
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	Книга = Excel.WorkBooks.Open(Путь);
	////Зададим первому листу имя
	Лист = Книга.WorkSheets(1);
	СчетчикСтрок = 7; //Заполнение ТЧ начинаем с седьмой строки

	Попытка
		Для Каждого ТекСтрока Из Объект.Выгрузка Цикл
			//Excel.Cells(СчетчикСтрок, 1).Value 			= СтрЗаменить(Строка(ТекСтрока.НомерУПСЗН), Символы.НПП, "");
			//Excel.Cells(СчетчикСтрок, 2).Value 			= СтрЗаменить(Строка(ТекСтрока.IDУчетнойЗаписи), Символы.НПП, "");
			//Excel.Cells(СчетчикСтрок, 3).Value 			= Строка(ТекСтрока.ФИО);
			//Excel.Cells(СчетчикСтрок, 4).Value 			= СтрЗаменить(Строка(ТекСтрока.ЛицевойСчет), Символы.НПП, "");
			Excel.Cells(СчетчикСтрок, 5).Value 			= ТекСтрока.СуммаНасчитаная;
			Excel.Cells(СчетчикСтрок, 6).Value 			= ТекСтрока.СуммаКОплате;
			//Excel.Cells(СчетчикСтрок, 7).Value 			= ТекСтрока.ОплаченнаяСумма;
			СчетчикСтрок = СчетчикСтрок + 1;
		КонецЦикла;
		
	Исключение
		Excel.Quit();
		Сообщить(информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Попытка
		Книга.SaveAs(Путь);
		Сообщить("Файл " + Путь + " успешно сохранен"); 
	Исключение
		Excel.Quit();
		Сообщить("Файл не сохранен!");
		Возврат;
	КонецПопытки;
	
	Попытка			
		Excel.Quit();
	Исключение			
		Сообщить(информацияОбОшибке());
		Возврат;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция НайтиЛСЛьготника(ИД)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	СведенияОПрописанныхЖильцахСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.СведенияОПрописанныхЖильцах.СрезПоследних(
	    |			&НаДату,
	    |			Жилец.ИДЛьготы = &ИДЛьготы
	    |				И Прописан = ИСТИНА) КАК СведенияОПрописанныхЖильцахСрезПоследних";

	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ИДЛьготы", ИД);
	тзЛС = Запрос.Выполнить().Выгрузить();
	Если тзЛС.Количество() <> 0 Тогда
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЛС = Выборка.ЛицевойСчет;
		КонецЦикла;
	    Возврат ЛС;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		    "ВЫБРАТЬ
		    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрСведений.ЛицевыеСчета.СрезПоследних КАК ЛицевыеСчетаСрезПоследних
		    |ГДЕ
		    |	ЛицевыеСчетаСрезПоследних.Регистратор.ОтветственныйВладелец.ФизЛицо.ИДЛьготы = &ИДЛьготы";
		Запрос.УстановитьПараметр("ИДЛьготы", ИД);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЛС = Выборка.ЛицевойСчет;
		КонецЦикла;
	    Возврат ЛС;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗагрузка(Команда)
	Путь = Объект.ФайлЕксель;
	Объект.Загрузка.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();//Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик = 7 По КоличествоСтрок Цикл
		НоваяСтрока                   = Объект.Загрузка.Добавить();
		НоваяСтрока.НомерУПСЗН        = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.IDУчетнойЗаписи   = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.ФИО               = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.ЛицевойСчет       = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.СуммаНасчитаная   = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.СуммаКОплате      = Excel.Cells(Счетчик, 6).Value;
		НоваяСтрока.ОплаченнаяСумма   = Excel.Cells(Счетчик, 7).Value;
	КонецЦикла;
	
	Excel.Workbooks.Close();
	Excel.Quit();
КонецПроцедуры
